taskt/Core/Automation/Commands/WindowGroup/AWindowNameCoreCommands_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.AWindowNameCoreCommands" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.AWindowNamesCommands" [ label="AWindowNamesCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AWindowNameCoreCommands" [ label="AWindowNameCoreCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AOneWindowNameCommands" [ label="AOneWindowNameCommands", style="dashed", ];
"taskt.Core.Automation.Commands.WaitForWindowToExistsCommand" [ label="WaitForWindowToExistsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ActivateWindowsCommand" [ label="ActivateWindowsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetFromWindowNamesAsListCommands" [ label="GetFromWindowNamesAsListCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AWindowNamesActionCommnads" [ label="AWindowNamesActionCommnads", style="dashed", ];
"taskt.Core.Automation.Commands.GetFromWindowNamesAsDataTableCommands" [ label="GetFromWindowNamesAsDataTableCommands", style="dashed", ];
"taskt.Core.Automation.Commands.GetWindowNamesCommand" [ label="GetWindowNamesCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CheckWindowNameExistsCommand" [ label="CheckWindowNameExistsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementsTreeXMLFromWindowNameCommand" [ label="UIAutomationSearchUIElementsTreeXMLFromWindowNameCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.AOneWindowNameActionCommands" [ label="AOneWindowNameActionCommands", style="dashed", ];
"taskt.Core.Automation.Commands.ActivateOneWindowCommand" [ label="ActivateOneWindowCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetOneWindowHandleFromOneWindowNameCommand" [ label="GetOneWindowHandleFromOneWindowNameCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetOneProcessNameFromOneWindowNameCommand" [ label="GetOneProcessNameFromOneWindowNameCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetOneWindowStateCommand" [ label="GetOneWindowStateCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetOneWindowPositionCommand" [ label="GetOneWindowPositionCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetOneWindowSizeCommand" [ label="GetOneWindowSizeCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationGetWindowUIElementFromWindowNameCommand" [ label="UIAutomationGetWindowUIElementFromWindowNameCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetWindowStatesFromWindowNamesAsListCommand" [ label="GetWindowStatesFromWindowNamesAsListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetWindowSizesFromWindowNamesAsListCommand" [ label="GetWindowSizesFromWindowNamesAsListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetWindowPositionsFromWindowNamesAsListCommand" [ label="GetWindowPositionsFromWindowNamesAsListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetWindowHandlesFromWindowNamesAsListCommand" [ label="GetWindowHandlesFromWindowNamesAsListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetProcessNamesFromWindowNamesAsListCommand" [ label="GetProcessNamesFromWindowNamesAsListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetWindowsStateCommand" [ label="SetWindowsStateCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ResizeWindowsCommand" [ label="ResizeWindowsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.MoveWindowsCommand" [ label="MoveWindowsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CloseWindowsCommand" [ label="CloseWindowsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetWindowHandlesFromWindowNamesAsDataTableCommand" [ label="GetWindowHandlesFromWindowNamesAsDataTableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetWindowStatesFromWindowNamesAsDataTableCommand" [ label="GetWindowStatesFromWindowNamesAsDataTableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetWindowSizesFromWindowNamesAsDataTableCommand" [ label="GetWindowSizesFromWindowNamesAsDataTableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetWindowPositionsFromWindowNamesAsDataTableCommand" [ label="GetWindowPositionsFromWindowNamesAsDataTableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetProcessNamesFromWindowNamesAsDataTableCommand" [ label="GetProcessNamesFromWindowNamesAsDataTableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetOneWindowStateCommand" [ label="SetOneWindowStateCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ResizeOneWindowCommand" [ label="ResizeOneWindowCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.MoveOneWindowCommand" [ label="MoveOneWindowCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CloseOneWindowCommand" [ label="CloseOneWindowCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.EnterShortcutKeyCommand" [ label="EnterShortcutKeyCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SendAdvancedKeyStrokesCommand" [ label="SendAdvancedKeyStrokesCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.EnterKeysCommand" [ label="EnterKeysCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.TakeScreenshotCommand" [ label="TakeScreenshotCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.AWindowNamesCommands" -> "taskt.Core.Automation.Commands.AWindowNameCoreCommands";
"taskt.Core.Automation.Commands.AOneWindowNameCommands" -> "taskt.Core.Automation.Commands.AWindowNameCoreCommands";
"taskt.Core.Automation.Commands.WaitForWindowToExistsCommand" -> "taskt.Core.Automation.Commands.AWindowNameCoreCommands";
"taskt.Core.Automation.Commands.ActivateWindowsCommand" -> "taskt.Core.Automation.Commands.AWindowNamesCommands";
"taskt.Core.Automation.Commands.GetFromWindowNamesAsListCommands" -> "taskt.Core.Automation.Commands.AWindowNamesCommands";
"taskt.Core.Automation.Commands.AWindowNamesActionCommnads" -> "taskt.Core.Automation.Commands.AWindowNamesCommands";
"taskt.Core.Automation.Commands.GetFromWindowNamesAsDataTableCommands" -> "taskt.Core.Automation.Commands.AWindowNamesCommands";
"taskt.Core.Automation.Commands.GetWindowNamesCommand" -> "taskt.Core.Automation.Commands.AWindowNamesCommands";
"taskt.Core.Automation.Commands.CheckWindowNameExistsCommand" -> "taskt.Core.Automation.Commands.AWindowNamesCommands";
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementsTreeXMLFromWindowNameCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameCommands";
"taskt.Core.Automation.Commands.AOneWindowNameActionCommands" -> "taskt.Core.Automation.Commands.AOneWindowNameCommands";
"taskt.Core.Automation.Commands.ActivateOneWindowCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameCommands";
"taskt.Core.Automation.Commands.GetOneWindowHandleFromOneWindowNameCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameCommands";
"taskt.Core.Automation.Commands.GetOneProcessNameFromOneWindowNameCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameCommands";
"taskt.Core.Automation.Commands.GetOneWindowStateCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameCommands";
"taskt.Core.Automation.Commands.GetOneWindowPositionCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameCommands";
"taskt.Core.Automation.Commands.GetOneWindowSizeCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameCommands";
"taskt.Core.Automation.Commands.UIAutomationGetWindowUIElementFromWindowNameCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameCommands";
"taskt.Core.Automation.Commands.GetWindowStatesFromWindowNamesAsListCommand" -> "taskt.Core.Automation.Commands.GetFromWindowNamesAsListCommands";
"taskt.Core.Automation.Commands.GetWindowSizesFromWindowNamesAsListCommand" -> "taskt.Core.Automation.Commands.GetFromWindowNamesAsListCommands";
"taskt.Core.Automation.Commands.GetWindowPositionsFromWindowNamesAsListCommand" -> "taskt.Core.Automation.Commands.GetFromWindowNamesAsListCommands";
"taskt.Core.Automation.Commands.GetWindowHandlesFromWindowNamesAsListCommand" -> "taskt.Core.Automation.Commands.GetFromWindowNamesAsListCommands";
"taskt.Core.Automation.Commands.GetProcessNamesFromWindowNamesAsListCommand" -> "taskt.Core.Automation.Commands.GetFromWindowNamesAsListCommands";
"taskt.Core.Automation.Commands.SetWindowsStateCommand" -> "taskt.Core.Automation.Commands.AWindowNamesActionCommnads";
"taskt.Core.Automation.Commands.ResizeWindowsCommand" -> "taskt.Core.Automation.Commands.AWindowNamesActionCommnads";
"taskt.Core.Automation.Commands.MoveWindowsCommand" -> "taskt.Core.Automation.Commands.AWindowNamesActionCommnads";
"taskt.Core.Automation.Commands.CloseWindowsCommand" -> "taskt.Core.Automation.Commands.AWindowNamesActionCommnads";
"taskt.Core.Automation.Commands.GetWindowHandlesFromWindowNamesAsDataTableCommand" -> "taskt.Core.Automation.Commands.GetFromWindowNamesAsDataTableCommands";
"taskt.Core.Automation.Commands.GetWindowStatesFromWindowNamesAsDataTableCommand" -> "taskt.Core.Automation.Commands.GetFromWindowNamesAsDataTableCommands";
"taskt.Core.Automation.Commands.GetWindowSizesFromWindowNamesAsDataTableCommand" -> "taskt.Core.Automation.Commands.GetFromWindowNamesAsDataTableCommands";
"taskt.Core.Automation.Commands.GetWindowPositionsFromWindowNamesAsDataTableCommand" -> "taskt.Core.Automation.Commands.GetFromWindowNamesAsDataTableCommands";
"taskt.Core.Automation.Commands.GetProcessNamesFromWindowNamesAsDataTableCommand" -> "taskt.Core.Automation.Commands.GetFromWindowNamesAsDataTableCommands";
"taskt.Core.Automation.Commands.SetOneWindowStateCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.ResizeOneWindowCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.MoveOneWindowCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.CloseOneWindowCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.EnterShortcutKeyCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.SendAdvancedKeyStrokesCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.EnterKeysCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.TakeScreenshotCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
}
